app/Http/Controllers/Auth/AuthenticatedSessionController.php

    public function store(LoginRequest $request)
    {

        $user = User::where('email',$request->email)->first();
        if($user != null)
        {
            $companyUser = User::where('id' , $user->created_by)->first();
---
select * from `users` where `email` = 'Suleimanabbas77@gmail.com' limit 1
select * from `users` where `id` = 2 limit 1

        $request->session()->regenerate();
        $user = Auth::user();

        $companyUser = User::find($user->created_by);
---
select * from `users` where `users`.`id` = 2 limit 1

        date_default_timezone_set($timezone);

        // Update Last Login Time
        $user->update(
            [
                'last_login_at' => Carbon::now()->toDateTimeString(),
            ]
        );
---
update `users` set `last_login_at` = '2025-03-11 12:19:40', `users`.`updated_at` = '2025-03-11 12:19:40' where `id` = 11