app/Http/Controllers/PurchaseController.php

public function index(Request $request)
{
    $vender = Vender::where('created_by', \Auth::user()->creatorId())->pluck('name', 'id');
    $vender->prepend('Select Vendor', '');

    $status = Purchase::$statues;

    $perPage = $request->get('per_page', 20);
    $search = $request->get('search', '');

    $query = Purchase::where('created_by', \Auth::user()->creatorId())
                     ->with(['vender', 'category']);

    if (!empty($search)) {
        $query->where(function ($q) use ($search) {
            $q->where('purchase_id', 'like', '%' . $search . '%')
              ->orWhereHas('vender', function ($vendorQuery) use ($search) {
                  $vendorQuery->where('name', 'like', '%' . $search . '%');
              })
              ->orWhereHas('category', function ($categoryQuery) use ($search) {
                  $categoryQuery->where('name', 'like', '%' . $search . '%');
              })
              ->orWhere('purchase_date', 'like', '%' . $search . '%')
              ->orWhere('creator', 'like', '%' . $search . '%'); // Search by creator ID
        });
    }

    $purchases = $query->paginate($perPage);
---
select `name`, `id` from `venders` where `created_by` = 2
select * from `purchases` where `created_by` = 2 limit 20 offset 3160
select count(*) as aggregate from `purchases` where `created_by` = 2
select * from `venders` where `created_by` = 2

    public function create($vendorId = 0)
    {
        if(\Auth::user()->can('create purchase'))
        {
            $customFields = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'purchase')->get();
---
select * from `custom_fields` where `created_by` = 2 and `module` = 'purchase'

    public function store(Request $request)
    {

        if(\Auth::user()->can('create purchase'))
        {
            $validator = \Validator::make(
                $request->all(), [
                    'vender_id' => 'required',
                    'warehouse_id' => 'required',
                    'purchase_date' => 'required|date|before_or_equal:today',
                    'category_id' => 'required',
                    'items' => 'required',
                ]
            );
            if($validator->fails())
            {
                $messages = $validator->getMessageBag();

                return redirect()->back()->with('error', $messages->first());
            }
            $purchase                 = new Purchase();
            $purchase->purchase_id    = $this->purchaseNumber();
            $purchase->vender_id      = $request->vender_id;
            $purchase->warehouse_id      = $request->warehouse_id;
            $purchase->purchase_date  = $request->purchase_date;
            $purchase->purchase_number   = !empty($request->purchase_number) ? $request->purchase_number : 0;
            $purchase->status         =  0;
            //            $purchase->discount_apply = isset($request->discount_apply) ? 1 : 0;
            $purchase->category_id    = $request->category_id;
            $purchase->created_by     = \Auth::user()->creatorId();
---
insert into `purchases` (`purchase_id`, `vender_id`, `warehouse_id`, `purchase_date`, `purchase_number`, `status`, `category_id`, `created_by`, `creator`, `updated_at`, `created_at`) values (3813, '2', '58', '2025-03-10', 0, 0, '1', 2, 20, '2025-03-11 09:37:28', '2025-03-11 09:37:28')

                $purchaseProduct->price       = $products[$i]['price'];
                $purchaseProduct->description = $products[$i]['description'];
                $purchaseProduct->creator     = \Auth::user()->id;
                $purchaseProduct->save();
---
insert into `purchase_products` (`purchase_id`, `product_id`, `quantity`, `tax`, `discount`, `price`, `description`, `creator`, `updated_at`, `created_at`) values (3815, '2', '8', '', '0', '500.00', '', 20, '2025-03-11 09:37:28', '2025-03-11 09:37:28')

    public function show($ids)
    {

        if(\Auth::user()->can('show purchase'))
        {
            try {
                $id       = Crypt::decrypt($ids);
            } catch (\Throwable $th) {
                return redirect()->back()->with('error', __('Purchase Not Found.'));
            }

            $id   = Crypt::decrypt($ids);
            $purchase = Purchase::find($id);

            if($purchase->created_by == \Auth::user()->creatorId())
            {

                $purchasePayment = PurchasePayment::where('purchase_id', $purchase->id)->first();
---
select * from `purchases` where `purchases`.`id` = 3686 limit 1
select * from `purchase_payments` where `purchase_id` = 3686 limit 1

    function purchaseNumber()
    {
        $latest = Purchase::where('created_by', '=', \Auth::user()->creatorId())->latest()->first();
---
select * from `purchases` where `created_by` = 2 order by `created_at` desc limit 1

    public function sent($id)
    {
        if (\Auth::user()->can('send purchase')) {
            DB::beginTransaction();
            try {
                $purchase = Purchase::where('id', $id)->first();

                if ($purchase->status == 1) {
                    return redirect()->back()->with('error', __('Purchase already sent.'));
                }

                $purchase->send_date = date('Y-m-d');
                $purchase->status = 1;
                $purchase->save();

                $vender = Vender::where('id', $purchase->vender_id)->first();
---
select * from `purchases` where `id` = '3776' limit 1
update `purchases` set `status` = 1, `send_date` = '2025-03-10', `purchases`.`updated_at` = '2025-03-10 15:04:01' where `id` = 3776
select * from `venders` where `id` = 100 limit 1