app/Http/Controllers/SystemController.php


            $setting = Utility::settingsById(\Auth::user()->id);
            // $comSetting = DB::table('settings')->where('created_by', '=', \Auth::user()->id)->pluck('name','value')->toArray();
            $comSetting = DB::table('settings')->where('created_by', '=', \Auth::user()->id)->pluck('value', 'name')->toArray();
---
select `value`, `name` from `settings` where `created_by` = 2

            // $emailSetting = Utility::settingsById(\Auth::user()->creatorId());


            $EmailTemplates = EmailTemplate::all();
            $ips = IpRestrict::where('created_by', \Auth::user()->creatorId())->get();
            // $languages = Utility::languages();

            //offer letter
            $Offerletter = GenerateOfferLetter::all();
            $currOfferletterLang = GenerateOfferLetter::where('created_by', \Auth::user()->id)->where('lang', $offerlang)->first();

            //joining letter
            $Joiningletter = JoiningLetter::all();
            $currjoiningletterLang = JoiningLetter::where('created_by', \Auth::user()->id)->where('lang', $joininglang)->first();

            //Experience Certificate
            $experience_certificate = ExperienceCertificate::all();
            $curr_exp_cetificate_Lang = ExperienceCertificate::where('created_by', \Auth::user()->id)->where('lang', $explang)->first();
---
select * from `email_templates`
select * from `ip_restricts` where `created_by` = 2
select * from `generate_offer_letters`
select * from `generate_offer_letters` where `created_by` = 2 and `lang` = 'en' limit 1
select * from `joining_letters`
select * from `joining_letters` where `created_by` = 2 and `lang` = 'en' limit 1
select * from `noc_certificates`
select * from `experience_certificates`
select * from `noc_certificates` where `created_by` = 2 and `lang` = 'en' limit 1
select * from `experience_certificates` where `created_by` = 2 and `lang` = 'en' limit 1

            $noc_certificate = NOC::all();
            $currnocLang = NOC::where('created_by', \Auth::user()->id)->where('lang', $noclang)->first();

            $emailSetting = DB::table('settings')->where('created_by', '=', \Auth::user()->id)->pluck('value', 'name')->toArray();
---
select `value`, `name` from `settings` where `created_by` = 2