app/Models/Utility.php

select * from `settings` where `created_by` = 1
---
    public static function getSetting()
    {
        if (self::$getsettings == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', 1)->get();

select * from `settings` where `created_by` = 2
---
    public static function getSettingById($id)
    {
        if (self::$getsettingsid == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', $id)->get();

select `full_name`, `code` from `languages`
---
    public static function languages()
    {
        if (self::$languageSetting == null) {
            $languages = Utility::langList();


            if (\Schema::hasTable('languages')) {
                $settings = Utility::settings();
                if (!empty($settings['disable_lang'])) {
                    $disabledlang = explode(',', $settings['disable_lang']);
                    $languages = Language::whereNotIn('code', $disabledlang)->pluck('full_name', 'code');
                } else {
                    $languages = Language::pluck('full_name', 'code');

select * from `taxes`
---
    public static function getTaxData()
    {
        $data = [];
        if (self::$rates == null) {
            $rates = Tax::get();

select * from `venders` where `venders`.`id` = 100 limit 1
update `venders` set `balance` = 5750, `venders`.`updated_at` = '2025-03-10 15:04:01' where `id` = 100
---
    public static function userBalance($users, $id, $amount, $type)
    {
        if ($users == 'customer') {
            $user = Customer::find($id);
        } else {
            $user = Vender::find($id);
        }

        if (!empty($user)) {
            if ($type == 'credit') {
                $oldBalance = $user->balance;
                $userBalance = $oldBalance + $amount;
                $user->balance = $userBalance;
                $user->save();

select * from `email_templates` where `name` LIKE 'vender_bill_sent' limit 1
select * from `user_email_templates` where `template_id` = 21 and `user_id` = 2 limit 1
---
    public static function sendEmailTemplate($emailTemplate, $mailTo, $obj)
    {
        $usr = Auth::user();
        //Remove Current Login user Email don't send mail to them
        // unset($mailTo[$usr->id]);
        $mailTo = array_values($mailTo);
        if ($usr->type != 'Super Admin') {
            // find template is exist or not in our record
            $template = EmailTemplate::where('name', 'LIKE', $emailTemplate)->first();
            if (isset($template) && !empty($template)) {
                // check template is active or not by company
                if ($usr->type != 'super admin') {
                    $is_active = UserEmailTemplate::where('template_id', '=', $template->id)->where('user_id', '=', $usr->creatorId())->first();

select * from `email_template_langs` where `parent_id` = 21 and `lang` LIKE 'en' limit 1
---
                        $setting[$row->name] = $row->value;
                    }
                    // get email content language base
                    $content = EmailTemplateLang::where('parent_id', '=', $template->id)->where('lang', 'LIKE', $usr->lang)->first();

select * from `company_payment_settings` where `created_by` = 2
---
    public static function getCompanyPaymentSetting($user_id)
    {

        $data = \DB::table('company_payment_settings');
        $settings = [];
        $data = $data->where('created_by', '=', $user_id);
        $data = $data->get();

select * from `product_services` where `product_services`.`id` = '2' limit 1
update `product_services` set `quantity` = 182706.5, `product_services`.`updated_at` = '2025-03-11 09:37:28' where `id` = 2
---
    public static function total_quantity($type, $quantity, $product_id)
    {
        $product = ProductService::find($product_id);

        if (($product->type == 'product')) {
            $pro_quantity = $product->quantity;

            if ($type == 'minus') {
                $product->quantity = $pro_quantity - $quantity;
            } else {
                $product->quantity = $pro_quantity + $quantity;
            }
            $product->save();

insert into `stock_reports` (`product_id`, `quantity`, `type`, `type_id`, `description`, `created_by`, `updated_at`, `created_at`) values ('2', '8', 'purchase', 3815, '8   quantity add in purchase #PUR03813', 2, '2025-03-11 09:37:28', '2025-03-11 09:37:28')
---
    public static function addProductStock($product_id, $quantity, $type, $description, $type_id)
    {

        $stocks = new StockReport();
        $stocks->product_id = $product_id;
        $stocks->quantity = $quantity;
        $stocks->type = $type;
        $stocks->type_id = $type_id;
        $stocks->description = $description;
        $stocks->created_by = \Auth::user()->creatorId();
        $stocks->save();

select `value`, `name` from `settings` where `created_by` = 1
select * from `users` where `type` = 'super admin' limit 1
---
    public static function colorset()
    {
        if (\Auth::check()) {
            if (\Auth::user()->type == 'super admin') {
                $user = \Auth::user();

                $setting = DB::table('settings')->where('created_by', $user->id)->pluck('value', 'name')->toArray();

            } else {
                $setting = DB::table('settings')->where('created_by', \Auth::user()->creatorId())->pluck('value', 'name')->toArray();
            }
        } else {
            $user = User::where('type', 'super admin')->first();

select * from `warehouse_products` where `product_id` = '2' and `warehouse_id` = '58' limit 1
select * from `warehouse_products` where (`warehouse_id` = '58' and `product_id` = '2' and `created_by` = 20) limit 1
---
    public static function addWarehouseStock($product_id, $quantity, $warehouse_id)
    {

        $product = WarehouseProduct::where('product_id', $product_id)->where('warehouse_id', $warehouse_id)->first();

        if ($product) {
            $pro_quantity = $product->quantity;
            $product_quantity = $pro_quantity + $quantity;
        } else {
            $product_quantity = $quantity;
        }

        $data = WarehouseProduct::updateOrCreate(
            ['warehouse_id' => $warehouse_id, 'product_id' => $product_id, 'created_by' => \Auth::user()->id],
            ['warehouse_id' => $warehouse_id, 'product_id' => $product_id, 'quantity' => $product_quantity, 'created_by' => \Auth::user()->id])

select * from `settings` where `created_by` = 1
---
    public static function getStorageSetting()
    {
        $data = DB::table('settings');
        $data = $data->where('created_by', '=', 1);
        $data = $data->get();